package com.xy.formula;

import java.math.BigDecimal;
import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;

public class UtilSkin {
   public static Map<Integer, String> localNameMap = new HashMap();

   public static String getLocalName(int var0) {
      return (String)localNameMap.get(var0);
   }

   public static String getRaceSting(int var0) {
      if (var0 >= (24483 & 28285) && var0 <= (24171 & 28606)) {
         return "人";
      } else if (var0 >= (21197 & 32571) && var0 <= (29499 & 24278)) {
         return "魔";
      } else if (var0 >= (24563 & 30205) && var0 <= (24058 & 30719)) {
         return "仙";
      } else {
         return var0 >= (23517 & 32251) && var0 <= (23023 & 32754) ? "鬼" : "龙";
      }
   }

   public static int a(int var0) {
      if ((var0 < (15964 & 18403) || var0 > (11903 & 22479)) && var0 != (8156 & 30711) && var0 != (16351 & 23422)) {
         if ((var0 < (4091 & 30076) || var0 > (26567 & 7615)) && var0 != (6143 & 32730) && var0 != (16365 & 23414)) {
            if ((var0 < (13789 & 20078) || var0 > (27871 & 6011)) && var0 != (8174 & 30717) && var0 != (8189 & 31599)) {
               if ((var0 < (15602 & 18365) || var0 > (9471 & 24511)) && var0 != (14331 & 24558) && var0 != (24559 & 15230)) {
                  if ((var0 < 2200 || var0 > 2215) && var0 != 6109 && var0 != 7016) {
                     if ((var0 < 2400 || var0 > 2415) && var0 != 6119 && var0 != 7020) {
                        if ((var0 < 1300 || var0 > 1315) && var0 != 6103 && var0 != 7009) {
                           if ((var0 < 1700 || var0 > 1715) && var0 != 6102 && var0 != 7008) {
                              if ((var0 < 2100 || var0 > 2115) && var0 != 7013 && var0 != 6105) {
                                 if ((var0 < 1000 || var0 > 1015) && var0 != 6118 && var0 != 7007) {
                                    if (var0 != 7019 && var0 != 6120) {
                                       if ((var0 < 1800 || var0 > 1815) && var0 != 6104 && var0 != 7011) {
                                          if ((var0 < 1900 || var0 > 1915) && var0 != 6108 && var0 != 7017) {
                                             if ((var0 < 2200 || var0 > 2215) && var0 != 6109 && var0 != 7010) {
                                                if ((var0 < 1500 || var0 > 1515) && var0 != 7014 && var0 != 6117) {
                                                   if ((var0 < 2000 || var0 > 2015) && var0 != 6107 && var0 != 7015) {
                                                      if (var0 != 7018 && var0 != 6121) {
                                                         return (var0 < 2617 || var0 > 2632) && var0 != 6125 && var0 != 7023 ? 0 : 18;
                                                      } else {
                                                         return 17;
                                                      }
                                                   } else {
                                                      return 16;
                                                   }
                                                } else {
                                                   return 15;
                                                }
                                             } else {
                                                return 14;
                                             }
                                          } else {
                                             return 13;
                                          }
                                       } else {
                                          return 12;
                                       }
                                    } else {
                                       return 11;
                                    }
                                 } else {
                                    return 10;
                                 }
                              } else {
                                 return 9;
                              }
                           } else {
                              return 8;
                           }
                        } else {
                           return 7;
                        }
                     } else {
                        return 6;
                     }
                  } else {
                     return 5;
                  }
               } else {
                  return 4;
               }
            } else {
               return 3;
            }
         } else {
            return 2;
         }
      } else {
         return 1;
      }
   }

   public static String getRaceMsg(BigDecimal var0) {
      if (var0 == null) {
         return "";
      } else {
         int var1;
         if ((var1 = var0.intValue()) == (20017 & 32751)) {
            return "#c000000逍遥生#r【种族】人【性别】男#r【武器】扇或剑#r一袭白衫，一把铁扇或一柄长剑，凭此三物而走遍江湖。与一般武夫不同的是，他们在快意恩仇之余也喜欢舞文弄墨。";
         } else if (var1 == (28267 & 24509)) {
            return "#c000000纯阳子#r【种族】人【性别】男#r【武器】扇子或书#r本风流倜傥一秀才，喜四处行走，行侠仗义。后因奇遇修行得道，跻身八仙，位列全真五祖。得正果后弃剑不用，羽扇轻挥，谈笑间惩恶扬善，令妖魔贼子闻风丧胆。";
         } else if (var1 == (32295 & 20474)) {
            return "#c000000剑侠客#r【种族】人【性别】男#r【武器】剑或锤#r潇洒倜傥，风度不凡。或手执长剑，或手握双锤，锄强扶弱，直指世间一切不平事。儿女情，英雄意，都付笑谈中。";
         } else if (var1 == (28199 & 24571)) {
            return "#c000000猛壮士#r【种族】人【性别】男#r【武器】拳套或斧#r豪迈而不拘小节，讲义气重情义，一身肝胆，不畏强暴，是响当当的好汉。外表虽然粗犷，但内心也有细腻的一面。";
         } else if (var1 == (28479 & 24295)) {
            return "#c000000飞剑侠#r【种族】人【性别】男#r【武器】剑或拳套#r行走江湖多年，现退隐江湖，已经不再过问江湖之事，一身绝世武功，能剑随意走，人剑合一。真是御剑游神州，世外逍遥侠。";
         } else if (var1 == (32359 & 20414)) {
            return "#c000000俏千金#r【种族】人【性别】女#r【武器】刀或枪矛#r出身于富贵之家，家门显赫，去不喜欢养尊处优；向往独立，渴望自由，英雌而自尊处优；向往独立，渴望自由，因此而自习得一身好刀法及枪法，令人不敢小窥。";
         } else if (var1 == (24486 & 28285)) {
            return "#c000000飞燕女#r【种族】人【性别】女#r【武器】钩或鞭子#r从小被异人带进深山修炼武艺，爱用短剑和鞭子，喜欢大自然，身轻如燕，生性自然跳脱，活泼可爱，是个天生的乐观派。";
         } else if (var1 == (20151 & 32621)) {
            return "#c000000英女侠#r【种族】人【性别】女#r【武器】刀或棍杖#r名士之女，贤淑端庄，有着一股与生俱来的浩然正气。擅使短刀或棍杖，有爱心，路见不平必拔刀相助，是个巾帼不让须眉的女侠。";
         } else if (var1 == (32300 & 20475)) {
            return "#c000000燕山雪#r【种族】人【性别】女#r【武器】剑或刀#r使得一手绝世剑法，武林中人不知其剑法从何而来，只知她出剑之处剑光如雪花，无处不在。是个十载燕山苦学艺，一朝功成闯江湖的侠义女子。";
         } else if (var1 == (24447 & 28330)) {
            return "#c000000红拂女#r【种族】人【性别】女#r【武器】鞭或剑#r此女为风尘三侠之一，以女流之身而修武入道，亦侠亦仙，属传说中的人物。其性情刁钻、武艺高强，见不得一点不平事，听不得一些是非语。手中长鞭有如龙蛇，矫灵异常，实为无知宵小的克星。";
         } else if (var1 == (31675 & 22095)) {
            return "#c000000巨魔王#r【种族】魔【性别】男#r【武器】刀或枪矛#r魔族之子，以庞大的身形庞大及天生的神力而著称。钟情的武器是大刀和枪矛，挥舞起来虎虎有声，令对手不战而退。";
         } else if (var1 == (31643 & 22126)) {
            return "#c000000夺命妖#r【种族】魔【性别】男#r【武器】刀或招魂幡#r有阴间“夺命杀手”之称。不喜欢硬打硬拼，刀走偏锋，专攻对手弱点；还有独门武器招魂幡，夺命勾魂，实是厉害非常。";
         } else if (var1 == (23195 & 30573)) {
            return "#c000000虎头怪#r【种族】魔【性别】男#r【武器】棍杖或抢矛#r足智多谋，力量与智慧的结合体。他们并不一味地依赖于与生俱来的魔族之力，而是尽可能多地拓展自己的潜能。拿手武器是棍杖和枪矛。";
         } else if (var1 == (31599 & 22175)) {
            return "#c000000逆天魔#r【种族】魔【性别】男#r【武器】枪或斧#r吸取日月精华，潜心修行千年，终于练就魔功。手中一把夺魂枪犀利非凡。一出手石破天惊，鬼哭神嚎，连神佛都不敢等闲视之。";
         } else if (var1 == (24575 & 29201)) {
            return "#c000000混天魔#r【种族】魔【性别】男#r【武器】刀或斧#r天庭诞生之前就存在的混世魔王，因屡屡扰乱天地和谐曾被元始天尊封印了九万九千九百年。形体极为高大修长，身着亮银魔甲，手执六鬼锁元刀，加上冷竣的眼神，给人一种不寒而栗的感觉。";
         } else if (var1 == (31727 & 22046)) {
            return "#c000000狐美人#r【种族】魔【性别】女#r【武器】爪或鞭#r天生对动物有着特别的感情，爱与动物为伴；驯有一妖狐，使得一手好鞭法，好胜心强，喜欢追求各种刺激和挑战。";
         } else if (var1 == 21005) {
            return "#c000000骨精灵#r【种族】魔【性别】女#r【武器】棍杖或剑#r由不死白骨吸取天地养分多年所化而成的妖精，对世间的许多事物都抱有一颗好奇之心。爱好和平，但受侵犯时也会以棍杖或短剑来出击自卫。";
         } else if (var1 == 21004) {
            return "#c000000小蛮妖#r【种族】魔【性别】女#r【武器】钩或刀#r刁蛮任性，性格泼辣，红色头饰和带刺的护腕使之显得与众不同。擅长单刀，刀法干脆利落；还有一对双钩，挥动起来也是得心应手。";
         } else if (var1 == 21008) {
            return "#c000000媚灵狐#r【种族】魔【性别】女#r【武器】刀或环#r乃是千年灵狐，吸天地灵气，修得正果，已是妖中之仙。手中一把半月刀更是灵气逼人，能在无形间取人性命。";
         } else if (var1 == 21010) {
            return "#c000000九尾狐#r【种族】魔【性别】女#r【武器】爪或钩#r狐修千年得一尾，该妖共有九尾，乃灵狐之祖。其长相极为妖媚，有一笑倾城，二笑倾国之容。攻击时一改柔弱之相，谈笑间挥动利爪将敌人瞬间撕为齑粉。";
         } else if (var1 == 22001) {
            return "#c000000神天兵#r【种族】仙【性别】男#r【武器】枪矛或锤#r一身金光黄金甲、一顶凤翅紫金冠，就是他们身为天界神兵的见证。神兵们都习得一手好枪法和锤法，对一切邪恶之徒可是毫不留情。";
         } else if (var1 == 22003) {
            return "#c000000龙战将#r【种族】仙【性别】男#r【武器】棍杖或爪#r身经百战的天界战将，不怒自威，一支舞得出神入化得棍杖和一对无坚不摧的利爪均是挡者披靡，让不少敌人闻风丧胆。";
         } else if (var1 == 22002) {
            return "#c000000智圣仙#r【种族】仙【性别】男#r【武器】拂尘或剑#r修道多年的神仙，以一把随身携带、伤人于无形的拂尘和利剑为除敌的武器。最可怕还是他们睿智的头脑，不轻易为敌人的挑衅所动。";
         } else if (var1 == 22007) {
            return "#c000000武尊神#r【种族】仙【性别】男#r【武器】枪或爪#r天神之子，自幼在天宫勤修仙术，虽未授神职，然仙力不亚大罗金仙，一身神功在天界早已传为嘉话，是未来仙界青睐的栋梁之材。";
         } else if (var1 == 22009) {
            return "#c000000紫薇神#r【种族】仙【性别】男#r【武器】剑或幡#r北极中天紫薇大帝，为斗部诸神之首，有着无上法力。身形端庄威武，一脸严肃之相。袖中暗藏一剑，犀利无匹。剑出，天地暗，神鬼泣，风云为之变色。";
         } else if (var1 == 22005) {
            return "#c000000舞天姬#r【种族】仙【性别】女#r【武器】飘带或棍#r美貌、优雅而高贵，讲究穿着和打扮。攻击时使用长棍或彩带，看似无力，但经她们的手施出时却让人不可轻视。";
         } else if (var1 == 22004) {
            return "#c000000精灵仙#r【种族】仙【性别】女#r【武器】刀或拳套#r精灵调皮，爱恶作剧和开些善意的玩笑。性格好动，因圆刀的外形可爱而选择了它作为防身武器，又因孩子气而喜欢上了拳套。";
         } else if (var1 == 22006) {
            return "#c000000玄剑娥#r【种族】仙【性别】女#r【武器】枪矛或剑#r神将之后，自小习武，因此不像普通女仙般喜欢脂粉，而独钟于武学；尤其擅长于枪矛和长剑。平时性格温和，但到了比武场上则是判若两人。";
         } else if (var1 == 22008) {
            return "#c000000玄天姬#r【种族】仙【性别】女#r【武器】飘带或环#r拥有超凡脱俗的气质，倾国倾城的容貌。飘逸的身形搭配上彩衣缎带，犹如画中仙。平时温文尔雅，不在万不得已之时不会轻易出手。";
         } else if (var1 == 22010) {
            return "#c000000霓裳仙#r【种族】仙【性别】女#r【武器】飘带或灯笼#r玉皇大帝之女，娇柔之状，我见尤怜。因自幼挚爱纺织，遂采白云为布、积月光为丝、以彩虹染色织就霓裳。难以想象一位那么娟秀的女子，一双如此柔弱的纤手竟能释放出那么强大的法术。";
         } else if (var1 == 23002) {
            return "#c000000猎魂引#r【种族】鬼【性别】男#r【武器】枪或拳套#r一个无忧无虑的草根少年，生时打猎为生，死后依然喜欢和小动物一起生活在丛林里。";
         } else if (var1 == 23003) {
            return "#c000000无崖子#r【种族】鬼【性别】男#r【武器】幡或书卷#r生前是容貌俊秀，文采出众的皇子。";
         } else if (var1 == 23001) {
            return "#c000000祭剑魂#r【种族】鬼【性别】男#r【武器】剑或刀#r每一把神兵名剑都是有意识的。兵器饮血越多，这种意识就会越强烈，最后脱离剑体，化而为灵。";
         } else if (var1 == 23005) {
            return "#c000000夜溪灵#r【种族】鬼【性别】女#r【武器】灯笼或环#r幽冥地府阴阳河中水灯化成的小鬼仙。";
         } else if (var1 == 23006) {
            return "#c000000幽梦影#r【种族】鬼【性别】女#r【武器】环或飘带#r大家闺秀，自小知书达理。因不满父母安排的婚姻，与封建礼教之间展开了殊死对抗。最终以死抗婚，用生命换取真爱和自由。";
         } else if (var1 == 23004) {
            return "#c000000墨衣行#r【种族】鬼【性别】女#r【武器】钩或鞭子#r生前是武艺高强、快意恩仇的江湖女子。在江湖恩怨中不行殒命。他们漠视生死，独来独往，荡尽泉下不平事。";
         } else if (var1 == 24001) {
            return "#c000000沧浪君#r【种族】龙【性别】男#r【武器】剑或书#r瀛海本无言，神龙闻其音。俯察麟羽迹，仰观日月行。万象走龙蛇，百感付啸吟。浮沉随波去，沧浪歌一声。";
         } else if (var1 == 24002) {
            return "#c000000龙渊客#r【种族】龙【性别】男#r【武器】枪或刀#r身如寒铁心似火，璞质浑然待雕琢。霹雳洞照冥蒙破，换骨脱胎成超卓。";
         } else if (var1 == 24003) {
            return "#c000000忘忧子#r【种族】龙【性别】男#r【武器】弓或环#r草木尚知愁，金鳞岂无忧?东风解微意，百草知寸心。";
         } else if (var1 == 24004) {
            return "#c000000骊珠儿#r【种族】龙【性别】女#r【武器】锤或钩#r明月沉海雾，鱼惊蛟夜哭。老蚌捧泪至，骊珠跳波出。";
         } else if (var1 == 24005) {
            return "#c000000木兰行#r【种族】龙【性别】女#r【武器】弓或枪#r红妆灼烁似血色，断角峥嵘作干戈。醉笑沙场何辞死，人间再作木兰歌。";
         } else if (var1 == 24006) {
            return "#c000000莫解语#r【种族】龙【性别】女#r【武器】剑或灯笼#r翩跹与鸟旋，婉转从鱼游。不解人间事，笑语问何愁。";
         } else if (var1 == 20011) {
            return "#c000000神秀生#r【种族】人【性别】男#r【武器】剑或棍";
         } else if (var1 == 20012) {
            return "#c000000玲珑女#r【种族】人【性别】女#r【武器】鞭或刀";
         } else if (var1 == 21011) {
            return "#c000000绝影魔#r【种族】魔【性别】男#r【武器】枪或刀";
         } else if (var1 == 21012) {
            return "#c000000霜月灵#r【种族】魔【性别】女#r【武器】钩或刀";
         } else if (var1 == 22011) {
            return "#c000000青阳使#r【种族】仙【性别】男#r【武器】棍或枪";
         } else if (var1 == 22012) {
            return "#c000000云中君#r【种族】仙【性别】女#r【武器】环或飘带";
         } else if (var1 == 23007) {
            return "#c000000南冠客#r【种族】鬼【性别】男#r【武器】剑或刀";
         } else if (var1 == 23008) {
            return "#c000000镜花影#r【种族】鬼【性别】女#r【武器】剑或飘带";
         } else if (var1 == 24007) {
            return "#c000000游无极#r【种族】龙【性别】男#r【武器】剑或刀";
         } else {
            return var1 == 24008 ? "#c000000临九渊#r【种族】龙【性别】女#r【武器】灯笼或飘带" : "";
         }
      }
   }

   public static int getLocalID(String var0) {
      Iterator var2;
      for(Iterator var10000 = var2 = localNameMap.keySet().iterator(); var10000.hasNext(); var10000 = var2) {
         int var1 = (Integer)var2.next();
         if (((String)localNameMap.get(var1)).equals(var0)) {
            return var1;
         }
      }

      return 24353 & 28415;
   }

   public static int getSex(BigDecimal var0) {
      int var1;
      return (var1 = var0.intValue() % (107 & 30)) != 3 >> 1 && var1 != 5 >> 1 && var1 != --3 && var1 != (111 & 23) && var1 != (93 & 43) ? 0 : 1;
   }

   public static int getRace(BigDecimal var0) {
      return var0 == null ? 3 >> 2 : 9981 + var0.intValue() / (15357 & 18410);
   }

   static {
      localNameMap.put(32301 & 20467, "逍遥生");
      localNameMap.put(24434 & 28335, "剑侠客");
      localNameMap.put(32307 & 20463, "猛壮士");
      localNameMap.put(28324 & 24447, "飞燕女");
      localNameMap.put(24559 & 28213, "英女侠");
      localNameMap.put(24559 & 28214, "俏千金");
      localNameMap.put(24359 & 28415, "飞剑侠");
      localNameMap.put(32750 & 20025, "燕山雪");
      localNameMap.put(24315 & 28461, "纯阳子");
      localNameMap.put(20015 & 32762, "红拂女");
      localNameMap.put(22159 & 31609, "虎头怪");
      localNameMap.put(24126 & 29643, "夺命妖");
      localNameMap.put(30379 & 23391, "巨魔王");
      localNameMap.put(22366 & 31405, "小蛮妖");
      localNameMap.put(32527 & 21245, "骨精灵");
      localNameMap.put(30367 & 23406, "狐美人");
      localNameMap.put(21007, "逆天魔");
      localNameMap.put(21008, "媚灵狐");
      localNameMap.put(21009, "混天魔");
      localNameMap.put(21010, "九尾狐");
      localNameMap.put(22001, "神天兵");
      localNameMap.put(22002, "智圣仙");
      localNameMap.put(22003, "龙战将");
      localNameMap.put(22004, "精灵仙");
      localNameMap.put(22005, "舞天姬");
      localNameMap.put(22006, "玄剑娥");
      localNameMap.put(22007, "武尊神");
      localNameMap.put(22008, "玄天姬");
      localNameMap.put(22009, "紫薇神");
      localNameMap.put(22010, "霓裳仙");
      localNameMap.put(23001, "祭剑魂");
      localNameMap.put(23002, "猎魂引");
      localNameMap.put(23003, "无崖子");
      localNameMap.put(23004, "墨衣行");
      localNameMap.put(23005, "夜溪灵");
      localNameMap.put(23006, "幽梦影");
      localNameMap.put(24001, "沧浪君");
      localNameMap.put(24002, "龙渊客");
      localNameMap.put(24003, "忘忧子");
      localNameMap.put(24004, "骊珠儿");
      localNameMap.put(24005, "木兰行");
      localNameMap.put(24006, "莫解语");
      localNameMap.put(20011, "神秀生");
      localNameMap.put(20012, "玲珑女");
      localNameMap.put(21011, "绝影魔");
      localNameMap.put(21012, "霜月灵");
      localNameMap.put(22011, "青阳使");
      localNameMap.put(22012, "云中君");
      localNameMap.put(23007, "南冠客");
      localNameMap.put(23008, "镜花影");
      localNameMap.put(24007, "游无极");
      localNameMap.put(24008, "临九渊");
   }
}
